Repository: Stof83/NetworkingKit
Catalog: Sources/NetworkingKit/Resources/Localizable/*.lproj/Localizable.strings
Languages: it

# an_error_occured
source: An error occurred. Please try again later!
it: Si è verificato un errore. Per favore riprova più tardi!

source: Error
it: Errore

source: Service error
it: Errore di servizio

# networkError.error.title
source: Request Error
it: Errore nella Richiesta

# networkError.error.description
source: An error occurred while processing the request.
it: Si è verificato un errore durante l'elaborazione della richiesta.

# networkError.not_connected.title
source: No Internet Connection
it: Nessuna Connessione Internet

# networkError.not_connected.description
source: Please check your network settings.
it: Si prega di verificare le impostazioni di rete.

# networkError.cancelled.title
source: Request Cancelled
it: Richiesta Annullata

# networkError.cancelled.description
source: The request was cancelled.
it: La richiesta è stata annullata.

# networkError.generic.title
source: Network Error
it: Errore di Rete

# networkError.generic.description
source: An unexpected error occurred during the network operation.
it: Si è verificato un errore imprevisto durante l'operazione di rete.

# networkError.url_generation.title
source: URL Generation Error
it: Errore Generazione URL

# networkError.url_generation.description
source: An error occurred while generating the URL.
it: Si è verificato un errore durante la generazione della URL.

# networkError.not_found.title
source: Resource Not Found
it: Risorsa Non Trovata

# networkError.not_found.description
source: The requested resource was not found on the server.
it: La risorsa richiesta non è stata trovata sul server.

# networkError.bad_response.title
source: Bad Response
it: Risposta Non Valida

# networkError.bad_response.description
source: A bad response was received from the server.
it: È stata ricevuta una risposta non valida dal server.

# networkError.failed_response.title
source: Failed Response
it: Risposta Fallita

# networkError.failed_response.description
source: The server failed to respond properly.
it: Il server non ha risposto correttamente.

# networkError.invalid_response.title
source: Invalid Response
it: Risposta Non Valida

# networkError.invalid_response.description
source: The server returned an invalid response.
it: Il server ha restituito una risposta non valida.

# networkError.no_data.title
source: No Data
it: Nessun Dato

# networkError.no_data.description
source: The server did not return any data.
it: Il server non ha restituito alcun dato.

# api_client_error.no_response.title
source: No Response
it: Nessuna Risposta

# api_client_error.no_response.description
source: The server did not provide any data in response to the request.
it: Il server non ha fornito alcun dato in risposta alla richiesta.

# api_client_error.no_valid_response.title
source: No Valid Response
it: Nessuna Risposta Valida

# api_client_error.no_valid_response.description
source: The server's response was empty or invalid.
it: La risposta del server era vuota o non valida.

# api_client_error.parsing_json.title
source: Data Error
it: Errore dati

# api_client_error.parsing_json.description
source: There was an issue with processing data from the server.
it: C'è stato un problema durante l'elaborazione dei dati provenienti dal server.

# api_client_error.network_failure.title
source: Network Failure
it: Errore di Rete

# api_client_error.network_failure.description
source: The request could not be completed due to a network problem.
it: La richiesta non ha potuto essere completata a causa di un problema di rete.

# api_client_error.server_error_message.title
source: Server Error
it: Errore del Server

# api_client_error.server_error_message.description
source: The server provided an error message in response to the request.
it: Il server ha fornito un messaggio di errore in risposta alla richiesta.

# api_client_error.invalid_response.title
source: Invalid Response
it: Risposta Non Valida

# api_client_error.invalid_response.description
source: The server returned an invalid response.
it: Il server ha restituito una risposta non valida.

# api_client_error.no_data.title
source: No Data
it: Nessun Dato

# api_client_error.no_data.description
source: The server did not return any data.
it: Il server non ha restituito alcun dato.
